# Списки ------------------------------------------------------------------------------

alphabet = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с",
            "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]

owner_menu = ["👤Профиль", "Новинки 🔥", "🔍 Поиск", "История 🗄️", "Регистрация", "Рассылка ⚠️"]

user_menu = ["👤Профиль", "Новинки 🔥", "🔍 Поиск", "История 🗄️"]

news_menu = ["Мужчинам", "Женщинам", "Всем", "Главное меню"]

main_menu_button = ["Главное меню"]
