from datetime import datetime

# Списки ------------------------------------------------------------------------------

genres_menu_list = ["Аниме", "Биография", "Боевик", "Вестерн", "Военный", "Детектив", "Детский", "18 +",
                    "Документальный", "Драма", "Игра", "История", "Комедия", "Концерт", "Короткометражка",
                    "Криминал", "Мелодрама", "Музыка", "Мультфильм", "Мюзикл", "Новости", "Приключения", "Реальное ТВ",
                    "Семейное", "Спорт", "Ток-Шоу", "Триллер", "Ужасы", "Фантастика", "Нуар", "Фэнтези", "Церемония"]

alphabet = ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с",
            "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]

search_menu = ["🔖 Название", "Рейтинг 🆒", "💰 Бюджет", "Жанр 🎭", "🗓️ Год", "Главное меню"]

owner_menu = ["👤Профиль", "Рандом 🎲", "🔍 Поиск", "История 🗄️", "🔑 Пользователи 🔑"]

year_film_menu = [f"{i}" for i in range(1950, int(datetime.now().year) + 1)]

user_menu = ["👤Профиль", "Рандом 🎲", "🔍 Поиск", "История 🗄️"]

news_menu = ["Мужчинам", "Женщинам", "Всем", "Главное меню"]

rate_money_menu = ["⬆️ Высокий бюджет", "Низкий бюджет ⬇️"]

rate_menu = ["1 - 2.5", "2.5 - 5", "5 - 7.5", "7.5 - 10"]

stat_menu = ["Обновить 🔄", "Главное меню"]

main_menu_button = ["Главное меню"]

random_menu = ["Рандом 🎲"]
